---
kind: type
id: T:Autodesk.Revit.DB.ImportInstance
source: html/85b534b8-dd6c-bc13-7c46-c803c83481e4.htm
---
# Autodesk.Revit.DB.ImportInstance

An element created during either import or link operation.
 It is an instance of CADLinkType.

## Syntax (C#)
```csharp
public class ImportInstance : Instance
```